package com.YIDA;

public class Menu {
    public static void firstInMenu(){
        System.out.println("**********************************************************");
        System.out.println("*******************欢迎使用收银台**************************");
        System.out.println("************[U]登陆*******[A]关于******[E]退出*************");
        System.out.println("************************请选择*****************************");
    }

    public static void useMenu(){
        System.out.println("*********************请选择*****************************");
        System.out.println("*********************[S]查看订单************************");
        System.out.println("*********************[A]加入购物车**********************");
        System.out.println("*********************[B]下载订单************************");
        System.out.println("*********************[D]删除此商品**********************");
        System.out.println("*********************[F]订单修改************************");
        System.out.println("*********************[C]订单取消************************");
        System.out.println("*********************[E]退出系统************************");
    }
    public static void about(){
        System.out.println("***************关于益逹收银台系统*************");
        System.out.println("*****************版权所有：@益逹**************");
        System.out.println("***********功能：实现简单的收银流程************");
    }
}
